docs/_posts/2022-02-06-test-org-mode.html
---
layout: post
title: "Blogging with org mode and jekyll"
tag: ["emacs", "jekyll", "org-mode", "blog"]
---
<p>
Org mode 테스트. Jekyll 에서 기본 지원하는 markdown 파일 대신,
Org mode 파일로 블로그 내용을 작성하고 Org mode 의 export html 기능을 이용하여 html 파일을 블로깅한다.
</p>
<div id="outline-container-org2891071" class="outline-2">
<h2 id="org2891071">참고 위키 사이트</h2>
<div class="outline-text-2" id="text-org2891071">
<p>
<a href="https://orgmode.org/worg/org-tutorials/org-jekyll.html">https://orgmode.org/worg/org-tutorials/org-jekyll.html</a>
</p>
</div>
</div>
<div id="outline-container-orgd12a0ac" class="outline-2">
<h2 id="orgd12a0ac">요약</h2>
<div class="outline-text-2" id="text-orgd12a0ac">
<ul class="org-ul">
<li>Jekyll 은 기본적으로 org 파일을 지원하지 않음</li>
<li>Org mode 의 export 기능을 이용하여 org 파일을 html 로 변환</li>
<li>Jekyll 은 <a href="https://jekyllrb.com/docs/front-matter/">front matter</a> 가 포함된 html 파일은 처리 가능</li>
</ul>
</div>
</div>
<div id="outline-container-orgf37b033" class="outline-2">
<h2 id="orgf37b033">Org mode 의 export html 을 위한 설정</h2>
<div class="outline-text-2" id="text-orgf37b033">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq org-publish-project-alist
      '(
        ("blog-posts"
         :base-directory "~/work/cuspymd.github.io/org/"
         :base-extension "org"
         :publishing-directory "~/work/cuspymd.github.io/docs/_posts"
         :recursive t
         :publishing-function org-html-publish-to-html
         :headline-levels 4
         :html-extension "html"
         :body-only t ;; Only export section between &lt;body&gt; &lt;/body&gt;
         )
        ("blog-assets"
         :base-directory "~/work/cuspymd.github.io/org/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|php"
         :publishing-directory "~/work/cuspymd.github.io/docs/assets"
         :recursive t
         :publishing-function org-publish-attachment)

        ("blog" :components ("blog-posts" "blog-assets"))
        ))
</pre>
</div>
<p>
위키 사이트에는 <code>org-html-publish-to-html</code> 가 <code>org-publish-org-to-html</code> 로 표현되어 있어 주의해야 한다.
<code>org-publish-org-to-html</code> 로 실행시 에러가 발생한다.
</p>
</div>
</div>
<div id="outline-container-org4e2857a" class="outline-2">
<h2 id="org4e2857a">그외 필요한 설정</h2>
<div class="outline-text-2" id="text-org4e2857a">
<div class="org-src-container">
<pre class="src src-emacs-lisp">'(org-export-with-section-numbers nil)
'(org-export-with-toc nil)
</pre>
</div>
<p>
html export 시 "Table Of Contents" 가 기본 생성된다. front matter 가 반드시 html 첫번째 줄에 위치해야 jekyll 에서
제대로 인식하는데 "Table Of Contents" 가 이를 방해하므로, 이를 해제하는 설정을 추가한다.
</p>
</div>
</div>
